def chech_winners(scores, student_score):
    """
    Определяет, входит ли балл студента в тройку лидеров

    Args:
        scores (list): Список баллов всех участников олимпиады
        student_score (int): Количество баллов, которое получил студент

    Returns:
        None: Функция ничего не возвращает, только печатает результат

    Example:
        >>> scores = [20, 48, 52, 38, 36, 13, 7, 41, 34, 24, 5, 51, 9, 14, 28]
        >>> check_winners(scores, 60)
        Вы в тройке!
        >>> check_winners(scores, 10)
        Вы не попали в тройку победителей.
    """
    s = sorted(scores) # сортируем результаты, чтобы узнать самые высокие
    st = student_score
    if st >= s[-1] or st >= s[-2] or st >= s[-3]: # т.к сортировка идет от меньшего к большему, берем последние резы
        print("Вы в тройке!")
    else:
        print("Вы не попали в тройку победителей.")
        
scores = [20, 48, 52, 38, 36, 13, 7, 41, 34, 24, 5, 51, 9, 14, 28]
chech_winners(scores,60)
