def print_pack_report(number):
    """
    Выводит отчёт о возможности расфасовки пирожных для чисел от `number` до 1.

    Args:
        number (int): Начальное число для обратного отсчёта (включительно).

    Returns:
        None: Функция ничего не возвращает, только печатает строки в консоль.

    Example:
        >>> print_pack_report(5)
        5 - расфасуем по 5
        4 - не заказываем!
        3 - расфасуем по 3
        2 - не заказываем!
        1 - не заказываем!
    """
    for i in range(number, 0, -1): # перебираем числа в порядке убывания
        if i % 3 == 0 and i % 5 == 0:
            print(f"{i} - расфасуем по 3 или по 5")
        elif i % 3 != 0 and i % 5 == 0:
            print(f"{i} - расфасуем по 5")
        elif i % 3 == 0 and i % 5 != 0:
            print(f"{i} - расфасуем по 3")
        else:
            print(f"{i} - не заказываем!")

print_pack_report(9)